controllers/UserController.php

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=50)
SELECT * FROM `user` WHERE `id`='47'
---
    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {