controllers/UserController.php

    public function actionCreate()
    {
        $model = new UserForm();

        if ($model->load(Yii::$app->request->post())) {
            $model->image1 = UploadedFile::getInstance($model, 'image1');
            $model->image2 = UploadedFile::getInstance($model, 'image2');

            if ($model->validate()) {
                $connection = \Yii::$app->db;
                $transaction = $connection->beginTransaction();

                try {
                    // create a new user
                    $user = new User();
                    $user->username = $model->username;
                    $user->save();

                    // create a new gallery
                    $gallery = new Gallery();
                    $gallery->userId = $user->id;
                    $gallery->type = $model->galleryType;
                    $gallery->save();
---
INSERT INTO `user` (`username`) VALUES ('angga lingga')
INSERT INTO `gallery` (`userId`, `type`) VALUES (48, 'Art')

    public function actionUpdate($id)
    {
        $user = $this->findModel($id);
        $model = new UserForm();
        $model->id = $user->id;
        $model->username = $user->username;
        $model->galleryType = $user->gallery->type;

        if ($model->load(Yii::$app->request->post())) {
            $model->image1 = UploadedFile::getInstance($model, 'image1');
            $model->image2 = UploadedFile::getInstance($model, 'image2');

            if ($model->validate()) {
                $connection = \Yii::$app->db;
                $transaction = $connection->beginTransaction();

                try {
                    // create a new user
                    $user->username = $model->username;
                    $user->update();

                    // create a new gallery
                    $gallery = $user->gallery;
                    $gallery->type = $model->galleryType;
                    $gallery->update();
---
SELECT * FROM `gallery` WHERE `userId`=50
UPDATE `gallery` SET `type`='Fiction' WHERE `id`=50